<a href="https://colab.research.google.com/github/Anjasfedo/data-analysis/blob/main/Polars.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [38]:
import polars as pl

pl.__version__

'0.20.2'

In [45]:
!pip install -U polars

import polars as pl

pl.__version__

Requirement already satisfied: polars in /usr/local/lib/python3.10/dist-packages (1.0.0)

'0.20.2'

# Series

In [6]:
series = pl.Series('age', [24, 20, 55, 44, 77, 16])

series

shape: (6,)
Series: 'age' [i64]
[
	24
	20
	55
	44
	77
	16
]

In [11]:
print(f"max: {series.max()}")
print(f"min: {series.min()}")
print(f"sum: {series.sum()}")
print(f"mean: {series.mean()}")
print(f"std: {series.std()}")
print(f"count: {series.count()}")

max: 77
min: 16
sum: 236
mean: 39.333333333333336
std: 23.829953140253266
count: 6

In [12]:
print(series.describe())

shape: (9, 2)
┌────────────┬───────────┐
│ statistic  ┆ value     │
│ ---        ┆ ---       │
│ str        ┆ f64       │
╞════════════╪═══════════╡
│ count      ┆ 6.0       │
│ null_count ┆ 0.0       │
│ mean       ┆ 39.333333 │
│ std        ┆ 23.829953 │
│ min        ┆ 16.0      │
│ 25%        ┆ 20.0      │
│ 50%        ┆ 44.0      │
│ 75%        ┆ 55.0      │
│ max        ┆ 77.0      │
└────────────┴───────────┘

In [14]:
print(f"sort asc: {series.sort(descending=False)}")
print(f"sort desc: {series.sort(descending=True)}")

sort asc: shape: (6,)
Series: 'age' [i64]
[
	16
	20
	24
	44
	55
	77
]
sort desc: shape: (6,)
Series: 'age' [i64]
[
	77
	55
	44
	24
	20
	16
]

In [17]:
series.to_pandas()

0    24
1    20
2    55
3    44
4    77
5    16
Name: age, dtype: int64

# Dataframes

In [20]:
from datetime import date

df = pl.DataFrame({
    "Employee ID": [1, 2, 3, 4, 5],
    "Name": ["Alice", "Bob", "Charlie", "Dave", "Eve"],
    "Age": [25, 30, 35, 40, 45],
    "Dapartement": ["HR", "Engineering", "Finance", "HR", "Finance"],
    "Salary": [50000, 60000, 70000, 80000, 90000],
    "Start Date": [date(2023, 5, 21), date(2023, 5, 22), date(2023, 5, 23), date(2023, 5, 24), date(2023, 5, 25)]
})

df

shape: (5, 6)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┘

In [22]:
df.head(2)

shape: (2, 6)
┌─────────────┬───────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name  ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---   ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str   ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪═══════╪═════╪═════════════╪════════╪════════════╡
│ 1           ┆ Alice ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 │
│ 2           ┆ Bob   ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 │
└─────────────┴───────┴─────┴─────────────┴────────┴────────────┘

In [23]:
df.tail(3)

shape: (3, 6)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╡
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┘

In [24]:
df.describe()

shape: (9, 7)
┌────────────┬─────────────┬───────┬──────────┬─────────────┬──────────────┬────────────┐
│ describe   ┆ Employee ID ┆ Name  ┆ Age      ┆ Dapartement ┆ Salary       ┆ Start Date │
│ ---        ┆ ---         ┆ ---   ┆ ---      ┆ ---         ┆ ---          ┆ ---        │
│ str        ┆ f64         ┆ str   ┆ f64      ┆ str         ┆ f64          ┆ str        │
╞════════════╪═════════════╪═══════╪══════════╪═════════════╪══════════════╪════════════╡
│ count      ┆ 5.0         ┆ 5     ┆ 5.0      ┆ 5           ┆ 5.0          ┆ 5          │
│ null_count ┆ 0.0         ┆ 0     ┆ 0.0      ┆ 0           ┆ 0.0          ┆ 0          │
│ mean       ┆ 3.0         ┆ null  ┆ 35.0     ┆ null        ┆ 70000.0      ┆ null       │
│ std        ┆ 1.581139    ┆ null  ┆ 7.905694 ┆ null        ┆ 15811.388301 ┆ null       │
│ min        ┆ 1.0         ┆ Alice ┆ 25.0     ┆ Engineering ┆ 50000.0      ┆ 2023-05-21 │
│ 25%        ┆ 2.0         ┆ null  ┆ 30.0     ┆ null        ┆ 60000.0      ┆ null       │
│ 50%        ┆ 3.0         ┆ null  ┆ 35.0     ┆ null        ┆ 70000.0      ┆ null       │
│ 75%        ┆ 4.0         ┆ null  ┆ 40.0     ┆ null        ┆ 80000.0      ┆ null       │
│ max        ┆ 5.0         ┆ Eve   ┆ 45.0     ┆ HR          ┆ 90000.0      ┆ 2023-05-25 │
└────────────┴─────────────┴───────┴──────────┴─────────────┴──────────────┴────────────┘

In [26]:
df.schema

OrderedDict([('Employee ID', Int64),
             ('Name', Utf8),
             ('Age', Int64),
             ('Dapartement', Utf8),
             ('Salary', Int64),
             ('Start Date', Date)])

## Selecting Column

In [27]:
df_selected = df.select("Name", "Age")

df_selected

shape: (5, 2)
┌─────────┬─────┐
│ Name    ┆ Age │
│ ---     ┆ --- │
│ str     ┆ i64 │
╞═════════╪═════╡
│ Alice   ┆ 25  │
│ Bob     ┆ 30  │
│ Charlie ┆ 35  │
│ Dave    ┆ 40  │
│ Eve     ┆ 45  │
└─────────┴─────┘

In [35]:
df[["Name", "Age"]]

shape: (5, 2)
┌─────────┬─────┐
│ Name    ┆ Age │
│ ---     ┆ --- │
│ str     ┆ i64 │
╞═════════╪═════╡
│ Alice   ┆ 25  │
│ Bob     ┆ 30  │
│ Charlie ┆ 35  │
│ Dave    ┆ 40  │
│ Eve     ┆ 45  │
└─────────┴─────┘

## Selecting Row

In [36]:
df.filter(pl.col("Age") > 30)

shape: (3, 6)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╡
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┘

In [47]:
df.filter(pl.col("Dapartement") == "HR")

shape: (2, 6)
┌─────────────┬───────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name  ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---   ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str   ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪═══════╪═════╪═════════════╪════════╪════════════╡
│ 1           ┆ Alice ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 │
│ 4           ┆ Dave  ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 │
└─────────────┴───────┴─────┴─────────────┴────────┴────────────┘

In [52]:
df.filter(pl.col("Dapartement") == 'Finance', pl.col("Age") > 40)

shape: (1, 6)
┌─────────────┬──────┬─────┬─────────────┬────────┬────────────┐
│ Employee ID ┆ Name ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date │
│ ---         ┆ ---  ┆ --- ┆ ---         ┆ ---    ┆ ---        │
│ i64         ┆ str  ┆ i64 ┆ str         ┆ i64    ┆ date       │
╞═════════════╪══════╪═════╪═════════════╪════════╪════════════╡
│ 5           ┆ Eve  ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 │
└─────────────┴──────┴─────┴─────────────┴────────┴────────────┘

## Adding & Dropping Column

In [67]:
df.with_columns((pl.col("Salary") / 12).alias("Monthly Salary"))

shape: (5, 7)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┬────────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date ┆ Monthly Salary │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        ┆ ---            │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       ┆ f64            │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╪════════════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 ┆ 4166.666667    │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 ┆ 5000.0         │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 ┆ 5833.333333    │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 ┆ 6666.666667    │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 ┆ 7500.0         │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┴────────────────┘

In [70]:
df = df.with_columns([
    (pl.col("Salary") / 12).round(2).alias("Monthly Salary"),
    (pl.col("Salary") * 12).alias("Annual Salary"),
    (pl.col("Age") + 10).alias("New Age")
])

df

shape: (5, 9)
┌─────────────┬─────────┬─────┬─────────────┬───┬────────────┬─────────┬─────────────────┬─────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ … ┆ Start Date ┆ Monthly ┆ Annual Salary   ┆ New Age │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆   ┆ ---        ┆ Salary  ┆ ---             ┆ ---     │
│ i64         ┆ str     ┆ i64 ┆ str         ┆   ┆ date       ┆ ---     ┆ i64             ┆ i64     │
│             ┆         ┆     ┆             ┆   ┆            ┆ f64     ┆                 ┆         │
╞═════════════╪═════════╪═════╪═════════════╪═══╪════════════╪═════════╪═════════════════╪═════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ … ┆ 2023-05-21 ┆ 4166.67 ┆ 600000          ┆ 35      │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ … ┆ 2023-05-22 ┆ 5000.0  ┆ 720000          ┆ 40      │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ … ┆ 2023-05-23 ┆ 5833.33 ┆ 840000          ┆ 45      │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ … ┆ 2023-05-24 ┆ 6666.67 ┆ 960000          ┆ 50      │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ … ┆ 2023-05-25 ┆ 7500.0  ┆ 1080000         ┆ 55      │
└─────────────┴─────────┴─────┴─────────────┴───┴────────────┴─────────┴─────────────────┴─────────┘

In [72]:
df.drop("New Age")

shape: (5, 9)
┌─────────────┬─────────┬─────┬─────────────┬───┬────────────┬─────────┬─────────────────┬─────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ … ┆ Start Date ┆ Monthly ┆ Annual Salary   ┆ New Age │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆   ┆ ---        ┆ Salary  ┆ ---             ┆ ---     │
│ i64         ┆ str     ┆ i64 ┆ str         ┆   ┆ date       ┆ ---     ┆ i64             ┆ i64     │
│             ┆         ┆     ┆             ┆   ┆            ┆ f64     ┆                 ┆         │
╞═════════════╪═════════╪═════╪═════════════╪═══╪════════════╪═════════╪═════════════════╪═════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ … ┆ 2023-05-21 ┆ 4166.67 ┆ 600000          ┆ 35      │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ … ┆ 2023-05-22 ┆ 5000.0  ┆ 720000          ┆ 40      │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ … ┆ 2023-05-23 ┆ 5833.33 ┆ 840000          ┆ 45      │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ … ┆ 2023-05-24 ┆ 6666.67 ┆ 960000          ┆ 50      │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ … ┆ 2023-05-25 ┆ 7500.0  ┆ 1080000         ┆ 55      │
└─────────────┴─────────┴─────┴─────────────┴───┴────────────┴─────────┴─────────────────┴─────────┘

In [73]:
df

shape: (5, 9)
┌─────────────┬─────────┬─────┬─────────────┬───┬────────────┬─────────┬─────────────────┬─────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ … ┆ Start Date ┆ Monthly ┆ Annual Salary   ┆ New Age │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆   ┆ ---        ┆ Salary  ┆ ---             ┆ ---     │
│ i64         ┆ str     ┆ i64 ┆ str         ┆   ┆ date       ┆ ---     ┆ i64             ┆ i64     │
│             ┆         ┆     ┆             ┆   ┆            ┆ f64     ┆                 ┆         │
╞═════════════╪═════════╪═════╪═════════════╪═══╪════════════╪═════════╪═════════════════╪═════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ … ┆ 2023-05-21 ┆ 4166.67 ┆ 600000          ┆ 35      │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ … ┆ 2023-05-22 ┆ 5000.0  ┆ 720000          ┆ 40      │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ … ┆ 2023-05-23 ┆ 5833.33 ┆ 840000          ┆ 45      │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ … ┆ 2023-05-24 ┆ 6666.67 ┆ 960000          ┆ 50      │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ … ┆ 2023-05-25 ┆ 7500.0  ┆ 1080000         ┆ 55      │
└─────────────┴─────────┴─────┴─────────────┴───┴────────────┴─────────┴─────────────────┴─────────┘

In [74]:
df = df.drop("New Age")

df

shape: (5, 8)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┬────────────────┬───────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date ┆ Monthly Salary ┆ Annual Salary │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        ┆ ---            ┆ ---           │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       ┆ f64            ┆ i64           │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╪════════════════╪═══════════════╡
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 ┆ 4166.67        ┆ 600000        │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 ┆ 5000.0         ┆ 720000        │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 ┆ 5833.33        ┆ 840000        │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 ┆ 6666.67        ┆ 960000        │
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 ┆ 7500.0         ┆ 1080000       │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┴────────────────┴───────────────┘

## Sorting

In [76]:
df.sort("Salary", descending=True)

shape: (5, 8)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┬────────────────┬───────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date ┆ Monthly Salary ┆ Annual Salary │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        ┆ ---            ┆ ---           │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       ┆ f64            ┆ i64           │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╪════════════════╪═══════════════╡
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 ┆ 7500.0         ┆ 1080000       │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 ┆ 6666.67        ┆ 960000        │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 ┆ 5833.33        ┆ 840000        │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 ┆ 5000.0         ┆ 720000        │
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 ┆ 4166.67        ┆ 600000        │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┴────────────────┴───────────────┘

In [78]:
df.sort("Start Date", descending=True)

shape: (5, 8)
┌─────────────┬─────────┬─────┬─────────────┬────────┬────────────┬────────────────┬───────────────┐
│ Employee ID ┆ Name    ┆ Age ┆ Dapartement ┆ Salary ┆ Start Date ┆ Monthly Salary ┆ Annual Salary │
│ ---         ┆ ---     ┆ --- ┆ ---         ┆ ---    ┆ ---        ┆ ---            ┆ ---           │
│ i64         ┆ str     ┆ i64 ┆ str         ┆ i64    ┆ date       ┆ f64            ┆ i64           │
╞═════════════╪═════════╪═════╪═════════════╪════════╪════════════╪════════════════╪═══════════════╡
│ 5           ┆ Eve     ┆ 45  ┆ Finance     ┆ 90000  ┆ 2023-05-25 ┆ 7500.0         ┆ 1080000       │
│ 4           ┆ Dave    ┆ 40  ┆ HR          ┆ 80000  ┆ 2023-05-24 ┆ 6666.67        ┆ 960000        │
│ 3           ┆ Charlie ┆ 35  ┆ Finance     ┆ 70000  ┆ 2023-05-23 ┆ 5833.33        ┆ 840000        │
│ 2           ┆ Bob     ┆ 30  ┆ Engineering ┆ 60000  ┆ 2023-05-22 ┆ 5000.0         ┆ 720000        │
│ 1           ┆ Alice   ┆ 25  ┆ HR          ┆ 50000  ┆ 2023-05-21 ┆ 4166.67        ┆ 600000        │
└─────────────┴─────────┴─────┴─────────────┴────────┴────────────┴────────────────┴───────────────┘

## Grouping & Aggregation

In [79]:
df["Salary"].max()

90000

In [81]:
df["Age"].mean()

35.0

In [85]:
df.filter(pl.col("Dapartement") == "HR")["Salary"].mean()

65000.0

In [88]:
df.group_by("Dapartement").agg([
    pl.col("Salary").max().alias("Max Salary"),
    pl.col("Age").mean().alias("Average Age")
])

shape: (3, 3)
┌─────────────┬────────────┬─────────────┐
│ Dapartement ┆ Max Salary ┆ Average Age │
│ ---         ┆ ---        ┆ ---         │
│ str         ┆ i64        ┆ f64         │
╞═════════════╪════════════╪═════════════╡
│ Finance     ┆ 90000      ┆ 40.0        │
│ Engineering ┆ 60000      ┆ 30.0        │
│ HR          ┆ 80000      ┆ 32.5        │
└─────────────┴────────────┴─────────────┘